In [9]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import linear_model
from sklearn.linear_model import LinearRegression

In [10]:
df=pd.read_csv("hiring.csv")
df

  experience  test_score  interview_score  salary_in_dollar
0        NaN         8.0                9             50000
1        NaN         8.0                6             45000
2       five         6.0                7             60000
3        two        10.0               10             65000
4      seven         9.0                6             70000
5      three         7.0               10             62000
6        ten         NaN                7             72000
7     eleven         7.0                8             80000

In [11]:
df.experience=df.experience.fillna("zero")
df

  experience  test_score  interview_score  salary_in_dollar
0       zero         8.0                9             50000
1       zero         8.0                6             45000
2       five         6.0                7             60000
3        two        10.0               10             65000
4      seven         9.0                6             70000
5      three         7.0               10             62000
6        ten         NaN                7             72000
7     eleven         7.0                8             80000

In [13]:
df.test_score.median()

8.0

In [15]:
df.test_score=df.test_score.fillna(df.test_score.median())

In [30]:
 df["experience"]=df.experience.astype(str)

In [35]:
!pip install word2number
from word2number import w2n
df.experience = df.experience.apply(w2n.word_to_num)

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: word2number in c:\users\asus\appdata\roaming\python\python310\site-packages (1.1)

ModuleNotFoundError: No module named 'word2number'